d = {'длинная': "дорога",
     'пустая': "бутылка",
     'великий': "новгород",
     'белокаменная': "москва",
     'пребрежный': "город",
     'серая': "мышь",
     'ласковый': "кот",
     'певучая': "птица",
     'старый': "дуб",
     'дождливая': "погода"}
keys_list = list(d.keys())
arr = 1
import random
g = random.choice(keys_list)
p = input(g + ":")
se = g,p
while se not in d.items():
    arr += 1
    p = input("попробуй ещё:")
    se = g,p
else:
    print("ты угадал")
    print("всего попыток:", arr)
    
